In [1]:
  import pandas as pd

In [2]:
df = pd.read_csv('movies.csv')

In [3]:
df.ndim

2

In [4]:
df.shape

(77, 8)

In [5]:
df.tail()

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year
72,Across the Universe,romance,Independent,84,0.652603,54,$29.37,2007.0
73,A Serious Man,Drama,Universal,64,4.382857,89,$30.68,2009.0
74,A Dangerous Method,Drama,Independent,89,0.448645,79,$8.97,2011.0
75,27 Dresses,Comedy,Fox,71,5.343622,40,$160.31,2008.0
76,(500) Days of Summer,comedy,Fox,81,8.096000,87,$60.72,2009.0

In [6]:
df.head

<bound method NDFrame.head of                                   Film    Genre            Lead_Studio  \
0           Zack and Miri Make a Porno  Romance  The Weinstein Company
1                      Youth in Revolt   Comedy  The Weinstein Company
2   You Will Meet a Tall Dark Stranger   Comedy            Independent
3                         When in Rome   Comedy                 Disney
4                What Happens in Vegas   Comedy                    Fox
..                                 ...      ...                    ...
72                 Across the Universe  romance            Independent
73                       A Serious Man    Drama              Universal
74                  A Dangerous Method    Drama            Independent
75                          27 Dresses   Comedy                    Fox
76                (500) Days of Summer   comedy                    Fox

    Audience_score  Profitability  Rotten_Tomatoes Worldwide_Gross    Year
0               70       1.747542               64         $41.94   2008.0
1               52       1.090000               68         $19.62   2010.0
2               35       1.211818               43         $26.66   2010.0
3               44       0.000000               15         $43.04   2010.0
4               72       6.267647               28        $219.37   2008.0
..             ...            ...              ...             ...     ...
72              84       0.652603               54         $29.37   2007.0
73              64       4.382857               89         $30.68   2009.0
74              89       0.448645               79          $8.97   2011.0
75              71       5.343622               40        $160.31   2008.0
76              81       8.096000               87         $60.72   2009.0

[77 rows x 8 columns]>

In [7]:
df.genre.unique()

AttributeError: 'DataFrame' object has no attribute 'genre'

In [ ]:
df.dtypes

In [ ]:
df.Film #Another way of writing : df.['Film']

In [ ]:
type(df.Film)

In [ ]:
df.Year.values # .values gives data in array form

In [ ]:
df.Year.to_list() # .values gives data in List form

In [ ]:
df[['Film','Genre']]

In [ ]:
df[(df.Year>2010)]

In [ ]:
df.Worldwide_Gross.min()

In [ ]:
## loc: Labels
##iloc: Indexing

df.iloc[[50]]

In [ ]:
df.iloc[50:55, [0,4]]

In [ ]:
df.iloc[1:11, :5]

In [ ]:
df.loc[65:71,['Film','Genre']]

In [ ]:
df1 = pd.DataFrame([['x',34,'d'],['y',23,'k']])
df1

In [ ]:
df1 = pd.DataFrame([['x',34,'d'],['y',23,'k']], columns=['name','marks','loc'],index=['s1','s2'])
df1

In [ ]:
df1.loc['s1']

In [ ]:
s1= pd.Series([1,2,3,4,5,6]) # Series made 1D data structure
s1

In [ ]:
df2 = pd.DataFrame([1,2,3,4,5]) # DataFrame made 2-D data structure, that is the difference from Series
df2

In [ ]:
df[(df.Year > 2010) & (df.Year < 2012)]

In [ ]:
df.Worldwide_Gross.aggregate(['min','max','mean','median'])

In [ ]:
df.sort_values('Profitability', ascending=True)

In [ ]:
df.reset_index(drop=True)
df

In [ ]:
df.Film.str.upper()

In [ ]:
df.head()

In [ ]:
df['Film'] = df.Film.str.upper()
df

In [ ]:
df.Year.max()

In [ ]:
df[df.Genre.str.contains('Drama')]

In [ ]:
df.Genre.str.contains('Drama') #If not passed as a dataframe it tells if it has drama or not!

In [ ]:
df['Film'] = df.Film.apply(str.lower)
df

In [ ]:
def to_upper(x):
    return x.upper()

In [ ]:
df['Film'] = df.Film.apply(to_upper)
df

In [ ]:
df.to_csv('updated_data.csv', index=False)

In [8]:
df.Genre.unique()

array(['Romance', 'Comedy', 'Drama', 'Animation', 'Fantasy', 'Romence',
       'Comdy', 'Action', 'romance', 'comedy'], dtype=object)

In [9]:
df.Profitability	.sum()

354.160221643

In [10]:
df.head()

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008.0
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010.0
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010.0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010.0
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008.0

In [11]:
df.shape

(77, 8)

In [12]:
import numpy as np
result = np.random.randint(0,2,df.shape[0])
result

array([0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1,
       0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1,
       1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0])

In [13]:
df['Review']= result

In [14]:
df.head()

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year,Review
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008.0,0
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010.0,1
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010.0,0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010.0,1
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008.0,0

In [15]:
df.Review.value_counts()

1    42
0    35
Name: Review, dtype: int64

In [16]:
df.drop('Review', axis =1)

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008.0
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010.0
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010.0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010.0
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008.0
...,...,...,...,...,...,...,...,...
72,Across the Universe,romance,Independent,84,0.652603,54,$29.37,2007.0
73,A Serious Man,Drama,Universal,64,4.382857,89,$30.68,2009.0
74,A Dangerous Method,Drama,Independent,89,0.448645,79,$8.97,2011.0
75,27 Dresses,Comedy,Fox,71,5.343622,40,$160.31,2008.0
76,(500) Days of Summer,comedy,Fox,81,8.096000,87,$60.72,2009.0

In [17]:
df

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year,Review
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008.0,0
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010.0,1
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010.0,0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010.0,1
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008.0,0
...,...,...,...,...,...,...,...,...,...
72,Across the Universe,romance,Independent,84,0.652603,54,$29.37,2007.0,1
73,A Serious Man,Drama,Universal,64,4.382857,89,$30.68,2009.0,0
74,A Dangerous Method,Drama,Independent,89,0.448645,79,$8.97,2011.0,1
75,27 Dresses,Comedy,Fox,71,5.343622,40,$160.31,2008.0,1
76,(500) Days of Summer,comedy,Fox,81,8.096000,87,$60.72,2009.0,0

In [18]:
df.drop('Review', axis =1, inplace=True)

In [19]:
df

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008.0
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010.0
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010.0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010.0
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008.0
...,...,...,...,...,...,...,...,...
72,Across the Universe,romance,Independent,84,0.652603,54,$29.37,2007.0
73,A Serious Man,Drama,Universal,64,4.382857,89,$30.68,2009.0
74,A Dangerous Method,Drama,Independent,89,0.448645,79,$8.97,2011.0
75,27 Dresses,Comedy,Fox,71,5.343622,40,$160.31,2008.0
76,(500) Days of Summer,comedy,Fox,81,8.096000,87,$60.72,2009.0

In [20]:
df.drop(['Film','Genre'], axis=1) #axis is 1 that mean we are dropping column

,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year
0,The Weinstein Company,70,1.747542,64,$41.94,2008.0
1,The Weinstein Company,52,1.090000,68,$19.62,2010.0
2,Independent,35,1.211818,43,$26.66,2010.0
3,Disney,44,0.000000,15,$43.04,2010.0
4,Fox,72,6.267647,28,$219.37,2008.0
...,...,...,...,...,...,...
72,Independent,84,0.652603,54,$29.37,2007.0
73,Universal,64,4.382857,89,$30.68,2009.0
74,Independent,89,0.448645,79,$8.97,2011.0
75,Fox,71,5.343622,40,$160.31,2008.0
76,Fox,81,8.096000,87,$60.72,2009.0

In [21]:
df.head()

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008.0
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010.0
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010.0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010.0
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008.0

In [22]:
df.drop(0,axis=0) #dropping first row

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010.0
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010.0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010.0
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008.0
5,Water For Elephants,Drama,20th Century Fox,72,3.081421,60,$117.09,2011.0
...,...,...,...,...,...,...,...,...
72,Across the Universe,romance,Independent,84,0.652603,54,$29.37,2007.0
73,A Serious Man,Drama,Universal,64,4.382857,89,$30.68,2009.0
74,A Dangerous Method,Drama,Independent,89,0.448645,79,$8.97,2011.0
75,27 Dresses,Comedy,Fox,71,5.343622,40,$160.31,2008.0
76,(500) Days of Summer,comedy,Fox,81,8.096000,87,$60.72,2009.0

In [23]:
df.drop([1,4,7,9],axis=0) #dropping multiple row

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008.0
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010.0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010.0
5,Water For Elephants,Drama,20th Century Fox,72,3.081421,60,$117.09,2011.0
6,WALL-E,Animation,Disney,89,2.896019,96,$521.28,2008.0
...,...,...,...,...,...,...,...,...
72,Across the Universe,romance,Independent,84,0.652603,54,$29.37,2007.0
73,A Serious Man,Drama,Universal,64,4.382857,89,$30.68,2009.0
74,A Dangerous Method,Drama,Independent,89,0.448645,79,$8.97,2011.0
75,27 Dresses,Comedy,Fox,71,5.343622,40,$160.31,2008.0
76,(500) Days of Summer,comedy,Fox,81,8.096000,87,$60.72,2009.0

In [24]:
df.isnull() #Tells if there is data missing in any frame

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
72,False,False,False,False,False,False,False,False
73,False,False,False,False,False,False,False,False
74,False,False,False,False,False,False,False,False
75,False,False,False,False,False,False,False,False
76,False,False,False,False,False,False,False,False

In [25]:
df.isnull().sum() # Tells how many data is missing in every column

Film               0
Genre              0
Lead_Studio        0
Audience_score     0
Profitability      0
Rotten_Tomatoes    0
Worldwide_Gross    0
Year               3
dtype: int64

In [26]:
df[df.Year.isnull()] #Shows values of Year which are missing

,Film,Genre,Lead_Studio,Audience_score,Profitability,Rotten_Tomatoes,Worldwide_Gross,Year
50,Life as We Know It,Comedy,Independent,62,2.530526,28,$96.16,NaN
52,Letters to Juliet,Comedy,Summit,62,2.639333,40,$79.18,NaN
53,Leap Year,Comedy,Universal,49,1.715263,21,$32.59,NaN

In [27]:
df.dropna(inplace=True) # drops all the column which hv missing data

In [28]:
df.Audience_score.aggregate(['min','max','mean','median'])

min       35.000000
max       89.000000
mean      63.972973
median    64.500000
Name: Audience_score, dtype: float64

In [29]:
sal = [12,15,17,10,13,19,200]
import numpy as np
np.mean(sal)

40.857142857142854

In [30]:
np.median(sal)

15.0

In [31]:
df.Year.aggregate(['min','max','mean','median'])

min       2007.000000
max       2011.000000
mean      2009.040541
median    2009.000000
Name: Year, dtype: float64

In [32]:
df.Year.unique()

array([2008., 2010., 2011., 2007., 2009.])

In [33]:
df.Year.value_counts()

2008.0    20
2010.0    17
2011.0    14
2009.0    12
2007.0    11
Name: Year, dtype: int64

In [34]:
df.Year.mode()

0    2008.0
dtype: float64

In [35]:
m = df.Year.mode()[0]
m

2008.0

In [36]:
df.fillna({'Year': m}, inplace=True) # Filling null values with most occuring values i.e. m which is mode of df
#df.fillna({'Year': df.Year.mean()}, inplace=True)
#df.fillna({'Year': df.Year.median()}, inplace=True)
#df.fillna({'Year': 2010}, inplace=True)
#df.fillna(0, inplace=True)

In [37]:
df.isnull().sum()

Film               0
Genre              0
Lead_Studio        0
Audience_score     0
Profitability      0
Rotten_Tomatoes    0
Worldwide_Gross    0
Year               0
dtype: int64

In [38]:
#to copy a dataframe
df2 = df.copy()

In [39]:
df2.select_dtypes(exclude=['object'])

    Audience_score  Profitability  Rotten_Tomatoes    Year
0               70       1.747542               64  2008.0
1               52       1.090000               68  2010.0
2               35       1.211818               43  2010.0
3               44       0.000000               15  2010.0
4               72       6.267647               28  2008.0
..             ...            ...              ...     ...
72              84       0.652603               54  2007.0
73              64       4.382857               89  2009.0
74              89       0.448645               79  2011.0
75              71       5.343622               40  2008.0
76              81       8.096000               87  2009.0

[74 rows x 4 columns]

In [40]:
df2.select_dtypes(include=['object'])

,Film,Genre,Lead_Studio,Worldwide_Gross
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,$41.94
1,Youth in Revolt,Comedy,The Weinstein Company,$19.62
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,$26.66
3,When in Rome,Comedy,Disney,$43.04
4,What Happens in Vegas,Comedy,Fox,$219.37
...,...,...,...,...
72,Across the Universe,romance,Independent,$29.37
73,A Serious Man,Drama,Universal,$30.68
74,A Dangerous Method,Drama,Independent,$8.97
75,27 Dresses,Comedy,Fox,$160.31
76,(500) Days of Summer,comedy,Fox,$60.72

In [41]:
df3 =pd.read_csv('text1.txt',sep=',',names=['Name','Marks','loc'])
df3

  Name  Marks loc
0   qr   23.0   m
1   we   43.0   n
2   ty    NaN   m
3  NaN   12.0   b
4   qw   34.0   ?

In [42]:
df3.isnull().sum()

Name     1
Marks    1
loc      0
dtype: int64

In [43]:
df3[df3['loc'].isin(['?'])]

  Name  Marks loc
4   qw   34.0   ?

In [44]:
df3 =pd.read_csv('text1.txt',sep=',',names=['Name','Marks','loc'],na_values=['?'])
df3

  Name  Marks  loc
0   qr   23.0    m
1   we   43.0    n
2   ty    NaN    m
3  NaN   12.0    b
4   qw   34.0  NaN

In [45]:
df3.isnull().sum()

Name     1
Marks    1
loc      1
dtype: int64

In [46]:
df3[df3['loc'].isin(['?'])]

Empty DataFrame
Columns: [Name, Marks, loc]
Index: []

In [47]:
df3.replace()

  Name  Marks loc
0   qr   23.0   m
1   we   43.0   n
2   ty   43.0   m
3   ty   12.0   b
4   qw   34.0   b

In [48]:
#Nominal: There is no order b/w categorical of a columns --> One hot Encoding
#Ordinal: There is no order b/w categorical of a columns -->Label Encoding

In [49]:
df = pd.DataFrame([['XL','B',34.5],['L','G',45.12],['S','W',50.2],['XL','B',85]],columns=['Size','Colour','Price'])
df

  Size Colour  Price
0   XL      B  34.50
1    L      G  45.12
2    S      W  50.20
3   XL      B  85.00

In [50]:
#One-hot-encoding: NominalCategoricalColumn
df_1 = pd.get_dummies(df.Colour)
df_1

   B  G  W
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [51]:
#Label Encoding:OrdinalColumn
df['Size'] = df.Size.map({'XL':3,'L':2,'S':1})
df

   Size Colour  Price
0     3      B  34.50
1     2      G  45.12
2     1      W  50.20
3     3      B  85.00

In [52]:
df.drop('Colour',axis=1,inplace=True)
df

   Size  Price
0     3  34.50
1     2  45.12
2     1  50.20
3     3  85.00

In [53]:
##Concatenation of 2 DF
final_data = pd.concat((df_1,df),axis=1)
final_data

   B  G  W  Size  Price
0  1  0  0     3  34.50
1  0  1  0     2  45.12
2  0  0  1     1  50.20
3  1  0  0     3  85.00

In [54]:
df

   Size  Price
0     3  34.50
1     2  45.12
2     1  50.20
3     3  85.00

In [55]:
df_1

   B  G  W
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [56]:
df = pd.read_csv('income1.csv')

In [57]:
df.shape

(48842, 15)

In [58]:
df

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48837,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
48838,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
48839,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [59]:
df.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [ ]:
df2.r

In [61]:
##Deal with categorical columns

In [62]:
cols = df.select_dtypes(include=['object'])
cols.head()

,workclass,education,marital-status,occupation,relationship,race,gender,native-country,income
0,Private,11th,Never-married,Machine-op-inspct,Own-child,Black,Male,United-States,<=50K
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,Husband,White,Male,United-States,<=50K
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,Husband,White,Male,United-States,>50K
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,United-States,>50K
4,?,Some-college,Never-married,?,Own-child,White,Female,United-States,<=50K

In [63]:
c = cols.columns
c

Index(['workclass', 'education', 'marital-status', 'occupation',
       'relationship', 'race', 'gender', 'native-country', 'income'],
      dtype='object')

In [ ]:
df[df['loc'].isin(['?'])].shape[0]

In [65]:
df['native-country'].unique()

array(['United-States', '?', 'Peru', 'Guatemala', 'Mexico',
       'Dominican-Republic', 'Ireland', 'Germany', 'Philippines',
       'Thailand', 'Haiti', 'El-Salvador', 'Puerto-Rico', 'Vietnam',
       'South', 'Columbia', 'Japan', 'India', 'Cambodia', 'Poland',
       'Laos', 'England', 'Cuba', 'Taiwan', 'Italy', 'Canada', 'Portugal',
       'China', 'Nicaragua', 'Honduras', 'Iran', 'Scotland', 'Jamaica',
       'Ecuador', 'Yugoslavia', 'Hungary', 'Hong', 'Greece',
       'Trinadad&Tobago', 'Outlying-US(Guam-USVI-etc)', 'France',
       'Holand-Netherlands'], dtype=object)

In [66]:
df['native-country'].value_counts()

United-States                 43832
Mexico                          951
?                               857
Philippines                     295
Germany                         206
Puerto-Rico                     184
Canada                          182
El-Salvador                     155
India                           151
Cuba                            138
England                         127
China                           122
South                           115
Jamaica                         106
Italy                           105
Dominican-Republic              103
Japan                            92
Guatemala                        88
Poland                           87
Vietnam                          86
Columbia                         85
Haiti                            75
Portugal                         67
Taiwan                           65
Iran                             59
Greece                           49
Nicaragua                        49
Peru                             46
Ecuador                          45
France                           38
Ireland                          37
Hong                             30
Thailand                         30
Cambodia                         28
Trinadad&Tobago                  27
Laos                             23
Yugoslavia                       23
Outlying-US(Guam-USVI-etc)       23
Scotland                         21
Honduras                         20
Hungary                          19
Holand-Netherlands                1
Name: native-country, dtype: int64

In [67]:
m = []

for i in df['native-country']:
    if i=='United-States':
        m.append('US')
    else:
        m.append('others')

In [68]:
df['native-country'] = m

In [69]:
cols['native-country'] =m

C:\Users\risha\AppData\Local\Temp/ipykernel_6988/1045800431.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cols['native-country'] =m